app/controllers/additions_controller.rb

SELECT "additions".* FROM "additions"
---
  def index
    @additions = Addition.all

INSERT INTO "additions" ("user_id", "idea_id", "instruments", "blurb", "sound_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @addition = current_user.additions.new(addition_params)

    if @addition.save

SELECT  "additions".* FROM "additions" WHERE "additions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_addition
      @addition = Addition.find(params[:id])