app/controllers/authentications_controller.rb

  def register
    p user_params
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "yamo@yamo.com"], ["password_digest", "$2a$10$Q16cdhcz/VC92b4RUggIXOTH4mAgKmqLlu/wyOI4NxIvRYp9W6H4C"], ["created_at", 2017-02-16 12:40:10 UTC], ["updated_at", 2017-02-16 12:40:10 UTC]]