app/controllers/ideas_controller.rb

  def index
    @ideas = Idea.all
---
SELECT "ideas".* FROM "ideas"

  def create
    @idea = current_user.ideas.new(idea_params)

    if @idea.save
---
INSERT INTO "ideas" ("name", "sound_url", "user_id", "blurb", "instruments", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def set_idea
      @idea = Idea.find(params[:id])
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]